artillery_load_test.yaml
config:
  target: "http://dummy-target.com"
  processor: "./s3artilleryuploader.js"
  
  payload:
    path: "metadata2.csv"
    # Map the CSV columns to variables you can use in your scenarios
    fields:
      - "image_key"
      - "size_category"
      - "difficulty"
      - "file_size_kb"
    # 'random' picks a random row for each virtual user. 
    # 'sequence' iterates top-to-bottom.
    order: random 
    skipHeader: true

  phases:
    - duration: 60
      arrivalRate: 5
      name: "Warm up phase (5 uploads/sec for 1 min)"
    
    - duration: 30
      arrivalRate: 5
      rampTo: 100
      name: "Spike phase (Ramp up to 100 uploads/sec)"
      
    - duration: 60
      arrivalRate: 100
      name: "Sustained burst (100 uploads/sec for 1 min)"

scenarios:
  - name: "Process Image from CSV"
    flow:
      # Artillery automatically assigns the row data to the variables 
      # mapped in the 'fields' section above before triggering the function.
      - function: "uploadImage"